#YOLOv8 utilizing ResNet50 backbone from TIMM

# Parameters
nc: 9  #  Has to Matche the GRAZPEDWRI dataset classes
scales: # model compound scaling constants, i.e. 'n', 's', 'm', 'l', 'x'
  s: [0.33, 0.5, 1024] #small yolo version

backbone:
  # [from, repeats, module, args]
  # Using ResNet50 from TIMM library. 

  - [-1, 1, timm, [resnet50, {pretrained: True, out_indices: [2, 3, 4]}]]
  - [0, 1, "Index", [0]] #P3
  - [0, 1, "Index", [1]] #P4
  - [0, 1, "Index", [2]] #P5
  - [-1, 1, "SPPF", [2048, 5]] #Takes P5 (Layer3)

head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 1], 1, Concat, [1]] #backbone P4
  - [-1, 3, C2f, [512]] # 13

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 0], 1, Concat, [1]] #backbone P3
  - [-1, 3, C2f, [256]] # 16 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] #head P4
  - [-1, 3, C2f, [512]] # 19 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] #head P5
  - [-1, 3, C2f, [1024]] # 22 (P5/32-large)

  - [[16, 19, 22], 1, Detect, [nc]] #Detect(P3, P4, P5)