# yolov8_resnet50.yaml
# YOLOv8 utilizing ResNet50 backbone from TIMM

# Parameters
nc: 9  # <--- MUST BE 9 (Matches your GRAZPEDWRI dataset classes)
scales: # model compound scaling constants, i.e. 'n', 's', 'm', 'l', 'x'
  n: [0.33, 0.25, 1024] 

backbone:
  # [from, repeats, module, args]
  # Using ResNet50 from TIMM library. 
  # pretrained=True downloads weights learned on ImageNet (better starting point)
  - [-1, 1, timm, [resnet50, {pretrained: True, out_indices: [2, 3, 4]}]]

head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 1], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, C2f, [512]] # 13

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 0], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C2f, [256]] # 16 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2f, [512]] # 19 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 3, C2f, [1024]] # 22 (P5/32-large)

  - [[16, 19, 22], 1, Detect, [nc]] # Detect(P3, P4, P5)